io-test/experiment/results/1/ab.out
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking cpu-test-dora.diego-1.cf-app.com (be patient)


Server Software:        
Server Hostname:        cpu-test-dora.diego-1.cf-app.com
Server Port:            80

Document Path:          /
Document Length:        84 bytes

Concurrency Level:      100
Time taken for tests:   14.992 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      10000
Total transferred:      3140000 bytes
HTML transferred:       840000 bytes
Requests per second:    667.01 [#/sec] (mean)
Time per request:       149.923 [ms] (mean)
Time per request:       1.499 [ms] (mean, across all concurrent requests)
Transfer rate:          204.53 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       72   74  20.8     73    1300
Processing:    73   75   4.7     75     294
Waiting:       73   75   4.7     75     294
Total:        145  149  21.4    148    1373

Percentage of the requests served within a certain time (ms)
  50%    148
  66%    149
  75%    150
  80%    150
  90%    150
  95%    151
  98%    155
  99%    162
 100%   1373 (longest request)